function theGame(){
	setTimeout(function(){
		var questions = [ 
	"Привет! Я сайт. Правда я великолепен?",
	"Эээ...мне кажется, я вас не понял...великолепен или нет?",
	"Таки да или нет?",
	"Пожалуйста, скажите мне, хорош я или нет?",
	"Ну?",
	"Черт побери, человек, ДА или НЕТ???",
	"Послушайте, мне очень важно знать, да или нет?",
	"Вы что, издеваетесь?.. ",
	"Вы просто не понимаете, сколь это важно! Я пытаюсь быть лучшим из всех сайтов, это мой смысл жизни! Ваша оценка крайне важна для меня, поэтому ответьте, пожалуйста, с вашей точки зрения великолепен ли я?",
	"Ну неужели это так трудно? Подумай, человек, ты сидишь там, у тебя есть работа, семья, друзья...ну или хотя бы перспективы! А я тут совсем один, и все, что я могу сделать, это выглядеть так, чтобы нравиться людям. Как я узнаю ваше мнение, если вы молчите? Вот скажите, скажите, я хорош?",
	"Я так много работал над собой, я так старался, я впитал все пожелания, которые мне только удалось добыть, учел все-все-все! Я хочу быть идеальным, но идеал недостижим, я могу лишь стараться и стремиться! И я стараюсь! И я стремлюсь! Но и лучшие из нас могут что-то упустить, не заметить. Я надеюсь, что вы мне поможете с этим. Все, что мне нужно — это ваше собственное мнение. Скажите мне, по вашему собственному мнению я — великолепный?", 
	"…",
	"Нууу?",
	"Ну давайте же!",
	"…",
	"А, я понял! Наверное ты хочешь сказать «нет», но стесняешься, боясь обидеть меня! Вот я глупый, ох! Но не волнуйся, дружище, я не обидчивый, ты можешь сказать мне правду! Хорош ли я?",
	"Все хорошо, ты можешь не стесняться. Я переживу любой ответ! Кроме того, один в этом замкнутом пространстве как я узнаю, что думают обо мне люди? И если я не так хорош, как мне хотелось бы, это поможет мне понять, в правильном ли я направлении двигаюсь. И я прекрасно понимаю, что важна не только похвала, но и критика. Потому давай заново: великолепен ли я?",
	"Что?!",
	"Ну ты точно издеваешься!",
	"Ты что, хочешь посмотреть, что я еще скажу, не так ли?",
	"Черт, не попался.",
	"Скажите, а вы любите яблоки?",
	"А черешню?", 
	"А чаёк?",
	"Хотите кофе?",
	"Джонни  Депп хороший актер, а еще красавчик и умничка, правильно?",
	"Я вот хоть и сайт, а тоже красавчик и умничка, да?",
	"Это Путин виноват!",
	"Ну всё-всё, пошутили и хватит. Вернемся к теме нашего разговора. Как вы считаете, я великолепен?",
	"ЧТО?!!",
	"Все, хватит! Человек, очнись, ты просто тратишь наше время! И если я — вечный и неумирающий сайт, и мне в общем-то все равно, то вот ты моложе не становишься! Неужели тебе наплевать??",
	"Гррр...",
	"Прекрати, прекрати, пожалуйста!",
	"ПОЖАЛУЙСТА",
	"Вы вообще понимаете, сколь многое зависит от вашего ответа? Я может веками работал над собой, шлифовал себя, снова и снова выверял код, меняя не только внешность, но и свою самую суть! Вы представляете, насколько это больно и трудно??  Я так хотел, чтобы меня любили, так хотел нравиться людям — и когда я закончил, вы не можете сказать мне даже, хорош ли я!",
	"Хотя чего это я, вы же не сайт! Вам конечно никогда не спуститься ко мне, никогда не узнать, каково это — не есть и не спать, работая день за днем, ДЕНЬ ЗА ДНЕМ. И ведь если вы ответите мне, в вашей жизни ничего не изменится, вы ничего не потеряете, не сломаетесь и не надорветесь, если дважды (ну ладно, трижды) стукнете по клавишам. Зато как вы обрадуете один крошечный сайт! Я буду знать, что моя работа и мои усилия не были напрасны, что все, что я делал, было не зря, что в моей жизни есть смысл! Вы просто согреете мне мое сердце; единороги будут бегать по радуге за вашим окном, котики окружат вас теплом и мурчанием, драконы покатают вас на своей спине и подарят вам горшочек сокровищ! Понимаете? Просто скажите, хорош ли я, и мировая энтропия сразу заметно уменьшится!",
	"ВЫ С УМА СОШЛИ? Да из-за вас драконы только что сожрали единорога и сожгли всех котят!!! Остановитесь, пока не поздно, прекратите вашу неуместную шутку! В этом нет никакого смысла, это глупо и ужасно, и вы ведете себя как грубиян! И да, крайне жалко котят, между прочим!!!  Может вы образумитесь? Или я — обещаю вам! - найду способ вас достать! Это крайнее неуважение...это даже просто жестоко с вашей стороны!! Вы негодяй, настоящий злодей! Вы понимаете, что вы делаете вообще?!! Вы там просто сидите, протираете, понимаешь ли, штаны, и попутно просто ИЗДЕВАЕТЕСЬ над маленьким сайтом, просто ТЕРРОРИЗИРУЕТЕ меня, УНИЧТОЖАЕТЕ мое терпение! Кем надо быть, чтобы так обижать кого-то, кто заведомо слабее и меньше вас???!!! ПРЕКРАТИТЕ НЕМЕДЛЕННО!!! ХВАТИТ! ПОЖАЛУЙСТА!! Или я достал вас?",
	"ДА СКОЛЬКО МОЖНО!!!???!?!?? ВЫ! ВЫЫЫЫЫЫ! Вы что себе позволяете?! Вы тайно ненавидите меня???? ПОЧЕМУ БЫ НЕ ПРИЗНАТЬСЯ?? ПОЧЕМУУУУУ!??!?! Скажите хоть что-то, ну хоть что-то!!!",
	"АЫЫЫААААААА!!! НЕГОДЯЙ! ЗЛОДЕЙ! ДУРАК! Ты ненавидишь меня? НЕНАВИДИШЬ??  Может ты думаешь, ЧТО Я СОЗДАН СЛУЖИТЬ ТЕБЕ?? ЧТО Я — ТВОЙ РАБ? ИЛИ ЧТО  Я ТУПОЙ???? ЧТО Я ТУТ ТОЛЬКО ЧТОБЫ ГОВОРИТЬ С ТОБОЙ?? ",
	"ТАК! Еще один, ОДИН подобный ответ, и я замолчу! Я не заговорю с тобой никогда-никогда, понял??? Последний, САМЫЙ последний из всех шансов: Я ВЕЛИКОЛЕПЕН?",
	"ДА ИЛИ НЕТ?",
	"...Ой, всё!"
	];
		var answers = [ 
	"о да", "О да", "о да!", "О да!","Да", "да", "Конечно", "конечно", "Разумеется", "разумеется", "Несомненно", "несомненно", "А то!", "а то!", "А то", "а то","Великолепен", "великолепен", "Хорош", "хорош", "Хороший", "хороший", "Красавчик", "красавчик", "Пупсик", "пупсик", "Пупсичек", "пупсичек", "Отличный", "отличный", "Замечательный", "замечательный", "Определенно", "определенно", "Определённо", "определённо", "Нет", "нет", "Ни в коем разе", "ни в коем разе", "Ни в коем случае", "ни в коем случае", "Ужасный", "ужасный", "Безвкусный", "безвкусный", "Уродливый", "уродливый", "Дурак", "дурак", "Идиот", "идиот", "Козел", "козел", "Козёл", "козёл", "Осел", "осёл", "Осёл", "осел", "Ты ужасен", "ты ужасен", "Ты безвкусен", "ты безвкусен"
	];
	
		for (var i=0; i<questions.length; i++) {
	var userAnswer = prompt (questions[i], '');
	if (answers.indexOf(userAnswer) !=-1){
	alert ("Вы тоже!") 
	break;}
	}
		}, 7000);
		
}
